{
    "games": [
        {
            "game_name": "Mass Effect 2",
            "game_id": "1",
            "developer": "Bioware",
            "release_date": "January 26, 2010",
            "game_description": "Mass Effect 2 is a 2010 action role-playing game developed by BioWare and published by Microsoft Game Studios and Electronic Arts. It was released for Windows and the Xbox 360 in January 2010, as well as the PlayStation 3 the following year. It is the second installment in the Mass Effect series and a sequel to the original Mass Effect. The game takes place within the Milky Way galaxy during the 22nd century, where humanity is threatened by an insectoid alien race known as the Collectors. The player assumes the role of Commander Shepard, an elite human soldier who must assemble and gain the loyalty of a diverse team to stop the Collectors in a suicide mission. Using a completed saved game of its predecessor, the player can impact the game's story in numerous ways. For the game, BioWare changed several gameplay elements and further emphasized third-person shooter aspects, including limited ammunition and regenerable health. In contrast to the exclusive focus on the main story of the original Mass Effect, the developers opted to create a plot where optional missions had as much intensity as the main mission.",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/0/05/MassEffect2_cover.PNG"
        },
        {
            "game_name": "Stardew Valley",
            "game_id": "2",
            "developer": "ConcernedApe",
            "release_date": "February 26, 2016",
            "game_description": "Stardew Valley is a 2016 farm life simulation game developed by Eric 'ConcernedApe' Barone. Players take the role of a character who inherits their deceased grandfather's dilapidated farm in a place known as 'Stardew Valley'. Stardew Valley is an open-ended game where players manage a farm by clearing land, growing seasonal crops, and raising animals. Players can build skills in farming, foraging, fishing, mining, and combat. The game also includes social features, such as building relationships with townspeople, with the option to marry and have children. A later update added multiplayer, allowing online play with others. Barone developed Stardew Valley by himself for over four and a half years. He was heavily inspired by the Story of Seasons series, with additions to address some of those games' shortcomings. The game starts with the player character leaving their corporate job to manage a farm just outside of Pelican Town, a town in the eponymous Stardew Valley. The main objective is to restore the farm of the player's deceased grandfather and assist in the town’s revival by completing bundles of goods to help restore the Community Center.",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/f/fd/Logo_of_Stardew_Valley.png"
        },
        {
            "game_name": "Slime Rancher",
            "game_id": "3",
            "developer": "Monomi Park",
            "release_date": "August 1, 2017",
            "game_description": "Slime Rancher is a farm life sim video game developed and published by American indie studio Monomi Park. The game was released as an early access title in January 2016, with an official release on Windows, macOS, Linux and Xbox One on August 1, 2017. A PlayStation 4 version was released on August 21, 2018, and a Nintendo Switch version was released on August 11, 2021. A DLC named 'Slime Rancher: Secret Style Pack' was released on June 18, 2019 which added additional cosmetic appearances. A sequel, Slime Rancher 2, was released in early access on September 22, 2022, for Windows and Xbox Series X/S. A feature film adaptation is also in development. The game is played in an open worldand from a first-person perspective. The player controls a character named Beatrix LeBeau, a rancher who moves to a planet far from Earth called the Far Far Range to live the life of a 'slimerancher', which consists of constructing her ranch and exploring the world of the Far Far Range in order to collect, raise, feed, and breed slimes. ",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/d/d2/Slime_Rancher_cover_art.png"
        },
        {
            "game_name": "The Witcher 3: Wild Hunt",
            "game_id": "4",
            "developer": "CD Projekt Red",
            "release_date": "May 19, 2015",
            "game_description": "The Witcher 3: Wild Hunt is a 2015 action role-playing game developed and published by CD Projekt. It is the sequel to the 2011 game The Witcher 2: Assassins of Kings and the third game in The Witcher video game series, played in an open world with a third-person perspective. The games follow the Witcher series of fantasy novels by Polish author Andrzej Sapkowski. The game takes place in a fictional fantasy world based on Slavic folklore. Players control Geralt of Rivia, a monster slayer for hire known as a Witcher, and search for his adopted daughter who is on the run from the Wild Hunt. Players battle the game's many dangers with weapons and magic, interact with non-player characters, and complete quests and monster contracts to acquire experience points and gold, which are used to increase Geralt's abilities and purchase equipment. It holds more than 200 game of the yearawards and has been cited as one of the greatest video games ever made. Two expansions were also released to critical acclaim: Hearts of Stone and Blood and Wine.",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/0/0c/Witcher_3_cover_art.jpg"
        },
        {
            "game_name": "Mafia",
            "game_id": "5",
            "developer": "Hangar 13",
            "release_date": "September 25, 2020",
            "game_description": "Mafia: Definitive Edition is a 2020 action-adventure game developed by Hangar 13 and published by 2K. It is a remake of the 2002 video game Mafia and the fourth entry in the series. Like the original game, the remake is set within the fictional city of Lost Heaven, Illinois, during the 1930s, and follows the rise and fall of Tommy Angelo, a Sicilian American cab driver-turned-gangster, within the Salieri crime family. The game's open world nature allows players to explore Lost Heaven at their leisure when not completing missions to advance the narrative. This is mostly done in the Free Ride game mode, where players are not restricted by the linear nature of missions and can find hidden side missions and collectibles exclusive to this mode. The gameplay builds upon 2016's Mafia III, and features enhanced mission dynamics and the introduction of motorcycles to the series. While some of the veteran Czech Mafia voice cast returned for the remake, the English voices were recast. An original score was also created for the game. ",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/a/ae/Mafia_Definitive_Edition.jpg"
        },
        {
            "game_name": "Red Dead Redemption 2",
            "game_id": "6",
            "developer": "Rockstar",
            "release_date": "October 26, 2018",
            "game_description": "Red Dead Redemption 2 is a 2018 action-adventure game developed and published by Rockstar Games. The game is the third entry in the Red Dead series and a prequel to the 2010 game Red Dead Redemption. The story is set in a fictionalized representation of the United States in 1899 and follows the exploits of Arthur Morgan, an outlaw and member of the Van der Linde gang, who must deal with the decline of the Wild West while attempting to survive against government forces, rival gangs, and other adversaries. The game is presented through first- and third-person perspectives, and the player may freely roam its interactive open world. Gameplay elements include shootouts, robberies, hunting, horseback riding, interacting with non-player characters, and maintaining the character's honor rating through moral choices and deeds. A bounty system governs the response of law enforcement and bounty hunters to crimes committed by the player. It broke several records and had the second-biggest launch in the history of entertainment, generating US$725 million in sales from its opening weekend and exceeding the lifetime sales of Red Dead Redemption in two weeks. ",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/4/44/Red_Dead_Redemption_II.jpg"
        },
                {
            "game_name": "Minecraft",
            "game_id": "7",
            "developer": "Mojang Studios",
            "release_date": "November 18, 2011",
            "game_description": "Minecraft is a 2011 sandbox game developed and published by the Swedish video game developer Mojang Studios. Originally created by Markus 'Notch' Persson using the Java programming language, the first public alpha build was released on 17 May 2009. The game was continuously developed from then on, receiving a full release on 18 November 2011. Afterwards, Persson left Mojang and gave Jens 'Jeb' Bergensten control over development. In the years since its release, it has been ported to several platforms, including smartphones, tablets, and various video game consoles. In 2014, Mojang and the Minecraftintellectual property were purchased by Microsoft for US$2.5 billion. In Minecraft, players explore a procedurally generated, three-dimensional world with virtually infinite terrain made up of voxels. Players can discover and extract raw materials, craft tools and items, and build structures, earthworks, and machines. Depending on their chosen game mode, players can fight hostile mobs, as well as cooperate with or compete against other players in multiplayer. The game has two main modes: Survival mode, where players must acquire resources to survive, and Creative mode, where players have unlimited resources and the ability to fly. ",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/b/b6/Minecraft_2024_cover_art.png"
        },
        {
            "game_name": "Dragon Age: Origins",
            "game_id": "8",
            "developer": "Bioware",
            "release_date": "November 3, 2009",
            "game_description": "Dragon Age: Origins is a 2009 role-playing video game developed by BioWareand published by Electronic Arts. It is the first game in the Dragon Agefranchise. Set in the fictional kingdom of Ferelden during a period of civil strife, the game puts the player in the role of a warrior, mage, or rogue coming from an elven, human, or dwarven background. The player character is recruited into the Grey Wardens, an ancient order that stands against monstrous forces known as 'Darkspawn', and is tasked with defeating the Archdemon that commands them and ending their invasion. The game is played from a third-person perspectivethat can be shifted to a top-down perspective. Throughout the game, players encounter various companions, who play major roles in the game's plot and gameplay. BioWare described Dragon Age: Origins as a 'dark heroic fantasy' set in a unique world, and a spiritual successor to their previous Baldur's Gate and Neverwinter Nights franchises. Development of the game began in 2002 and BioWare employed more than 144 voice-actors, and hired Inon Zur to compose the game's music.",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/8/89/Dragon_Age_Origins_cover.png"
        },
        {
            "game_name": "Fallout 4",
            "game_id": "9",
            "developer": "Bethesda",
            "release_date": "November 10, 2015",
            "game_description": "Fallout 4 is a 2015 action role-playing game developed by Bethesda Game Studios and published by Bethesda Softworks. It is the fourth main game in the Fallout series and was released worldwide on November 10, 2015, for Microsoft Windows, PlayStation 4, and Xbox One. The game is set within an open world post-apocalyptic environment that encompasses the city of Boston and the surrounding Massachusetts region known as 'The Commonwealth'. The main story takes place in the year 2287, 10 years after the events of Fallout 3 and 210 years after 'The Great War', which caused a nuclear holocaust. The player assumes control of a character simply referred to as the 'Sole Survivor', who emerges from a long-term cryogenic stasis in Vault 111, an underground nuclear fallout shelter. After witnessing the murder of their spouse and the kidnapping of their son, the Sole Survivor ventures out into the Commonwealth to search for their missing child. The player explores the game's dilapidated world, completes various quests, helps out various factions, and acquires experience points to level up and increase the abilities of their character.",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/7/70/Fallout_4_cover_art.jpg"
        },
        {
            "game_name": "MGS V: Phantom Pain",
            "game_id": "10",
            "developer": "Konami",
            "release_date": "September 1, 2015",
            "game_description": "Metal Gear Solid V: The Phantom Pain is a 2015 action-adventure stealth game developed and published by Konami. Directed, written, and designed by Hideo Kojima (as his final work at Konami), it is the ninth installment in the Metal Gear franchise, following Metal Gear Solid V: Ground Zeroes, a stand-alone prologue released the previous year. Set in 1984, nine years after the events of Ground Zeroes, the story follows mercenary leader Punished 'Venom' Snake as he ventures into Soviet-occupied Afghanistan and the Angola–Zaire border region to exact revenge on those who destroyed his forces and came close to killing him during the climax of Ground Zeroes. The game is played from a third-person perspective in an open world which can be explored either on foot or by modes of transport. Snake can use a wide repertoire of weapons and items and receive assistance from several AI companions, allowing the player to combat enemies either stealthily or directly. Enemy soldiers and resources found in the world can be transported to Snake's headquarters, allowing for its expansion and the development of further technology.",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/8/8f/Metal_Gear_Solid_V_The_Phantom_Pain_cover.png"
        },
        {
            "game_name": "Sleeping Dogs",
            "game_id": "11",
            "developer": "United Front Games",
            "release_date": "August 14, 2012",
            "game_description": "Sleeping Dogs is a 2012 action-adventure game developed by United Front Games and published by Square Enix. The game was released for PlayStation 3, Windows, and Xbox 360 in August 2012. Set in contemporary Hong Kong, the story follows martial artist and undercover police officer Wei Shen who infiltrates the Sun On Yee Triadorganization. Gameplay focuses on Wei Shen's martial arts moves, fighting, shooting and parkour abilities, and on gadgets that can be used for combat and exploration. Players must complete missions to unlock content and continue the story, but they may instead freely roam the game's open world environment and engage in both legal and criminal activities. The latter may incite a police response, the intensity of which is controlled by a 'heat' system. Actions such as fighting, driving and racing grant Shen statistical rewards and earn the player achievements. Sleeping Dogs received positive reviews from critics for its combat, voice acting, protagonist, experience system and depiction of the city, but its camera and some animations were criticized. The game had sold over 1.5 million units by September 2012.",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/9/90/Sleeping_Dogs_-_Square_Enix_video_game_cover.jpg"
        },
        {
            "game_name": "Arkham Knight",
            "game_id": "12",
            "developer": "Rocksteady Studios",
            "release_date": "June 23, 2015",
            "game_description": "Batman: Arkham Knight is a 2015 action-adventure game developed by Rocksteady Studios and published by Warner Bros. Interactive Entertainment. Based on the DC Comics superhero Batman, it is the successor to the 2013 video game Batman: Arkham Origins, a direct sequel to Batman: Arkham City (2011) and the fourth main installment in the Batman: Arkham series. Written by Sefton Hill, Ian Ball, and Martin Lancaster, Arkham Knight is inspired by the long-running comic book mythos. Set nine months after the events of Arkham City, the game's main storyline follows Batman as he confronts Scarecrow, who has launched an attack on Gotham City and caused a citywide evacuation. Scarecrow, with the help of the mysterious Arkham Knight, plots to unite all of Gotham's criminals in an attempt to finally destroy Batman. The game is presented from a third-person perspective, with a primary focus on Batman's melee combat, stealth abilities, detective skills, and gadgets. Batman can freely move around the open world of Gotham City, interacting with characters and undertaking missions, and unlocking new areas by progressing through the main story or obtaining new equipment. ",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/6/6c/Batman_Arkham_Knight_Cover_Art.jpg"
        },
        {
            "game_name": "Rocket League",
            "game_id": "13",
            "developer": "Psyonix",
            "release_date": "July 7, 2015",
            "game_description": "Rocket League is a 2015 vehicular soccer video game developed and published by Psyonix for various home consoles and computers. A sequel to 2008's Supersonic Acrobatic Rocket-Powered Battle-Cars, Rocket League features up to eight players assigned to each of the two teams, using 'rocket-powered' vehicles to hit a ball into their opponent's goal and score points over the course of a match. The game includes single-player and multiplayer modes that can be played both locally and online, including cross-platform play between all versions.  ocket League was praised for its gameplay improvements over Supersonic Acrobatic Rocket Powered Battle-Cars, as well as its graphics and overall presentation, although some criticism was directed towards the game's physics engine. It has since been considered one of the greatest video games ever made. The game earned many industry awards and saw over 10 million sales and 40 million players by the beginning of 2018. Rocket League has also been adopted as an esport, with professional players participating through ESL and Major League Gaming along with Psyonix's own Rocket League Championship Series(RLCS).",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/1/13/Rocket_League_cover.png"
        },
        {
            "game_name": "Terraria",
            "game_id": "14",
            "developer": "Re-Logic",
            "release_date": "May 16, 2011",
            "game_description": "Terraria is a 2011 action-adventure sandbox game developed by Re-Logic and published by 505 Games. The game features exploration, combat, crafting, building, and mining inside a procedurally generated 2D world. It has several world difficulties, as well as a character class system. The player can encounter a variety of enemies throughout the game, such as those who spawn at a certain time or location or during special events, and can also complete specific goals to attract non-player characters who sell items and offer services to the player. Terraria also features support for modifications through tModLoader. erraria has received generally favorable reviews from critics. Gameplay aspects, such as exploration, replayability, and amount of content, have been praised, while the crafting system has been viewed as being complex. The lack of a tutorial for PC has also been criticized; however, the tutorial worlds of Xbox 360, PlayStation 3, and PS Vita were commended. The combat system, as well as the controls for Xbox 360 and PlayStation 3, and the retro-styled sprites were also positively received. ",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/1/1a/Terraria_Steam_artwork.jpg"
        },
        {
            "game_name": "Injustice: Gods Among Us",
            "game_id": "15",
            "developer": "NetherRealm Sudios",
            "release_date": "April 16, 2013",
            "game_description": "Injustice: Gods Among Us is a 2013 fighting video game. It is the first installment in the Injustice franchise based upon the fictional universe of DC Comics.  Players select one of several characters from the DC Universe (consisting of both villains and heroes), to engage in combat, aiming to knock out their opponent. The game is set in a 2.5D environment: while character models and backgrounds are rendered in three-dimensional graphics, the characters are restricted to fight within a two-dimensional space. Injustice builds upon several aspects from NetherRealm Studios' previous title, Mortal Kombat(2011), including its controls, game mechanics, narrative-driven campaign, and online functionality. The storyline is set in a parallel universe within the DC Comics' Multiverse, where Superman has become a tyrantand established a new world order after the Joker tricked him into killing Lois Lane and destroying Metropolis. In an effort to stop this, Batman summons counterparts of the League's members from the main universe to join his insurgency and end the totalitarian regime. The game received positive reviews from critics, who praised its story, gameplay mechanics, and use of the DC Comics license. ",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/f/f8/Injustice_Gods_Among_Us_Cover_Art.jpg"
        },
        {
            "game_name": "The Last of Us",
            "game_id": "16",
            "developer": "Naughty Dog",
            "release_date": "June 14, 2013",
            "game_description":"The Last of Us is a 2013 action-adventure game developed by Naughty Dog and published by Sony Computer Entertainment. Players control Joel, a smuggler tasked with escorting a teenage girl, Ellie, across a post-apocalyptic United States. The Last of Us is played from a third-person perspective. Players use firearms, improvised weapons, and stealth to defend against hostile humans and cannibalistic creatures infected by a mutated fungus. In the online multiplayer mode, up to eight players engage in cooperative and competitive gameplay. The game's development began in 2009 after the release of Naughty Dog's previous game, Uncharted 2: Among Thieves. The studio split into two teams for the first time, with one developing The Last of Us while the other worked on Uncharted 3: Drake's Deception. Troy Baker and Ashley Johnson portrayed Joel and Ellie, respectively, through voice and motion capture, and assisted creative director Neil Druckmann with developing the characters and story; Joel and Ellie's relationship became the focus of development, with all other elements crafted around it. The score was composed and performed by Gustavo Santaolalla.",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/4/46/Video_Game_Cover_-_The_Last_of_Us.jpg"
        },
        {
            "game_name": "Ghost Of Tsushima",
            "game_id": "17",
            "developer": "Sucker Punch",
            "release_date": "July 17, 2020",
            "game_description": "Ghost of Tsushima is a 2020 action-adventure game developed by Sucker Punch Productions and published by Sony Interactive Entertainment. The player controls Jin Sakai, a samurai on a quest to protect Tsushima Island during the first Mongol invasion of Japan. Jin must choose between following the warrior code to fight honorably, or by using practical but dishonorable methods of repelling the Mongols with minimal casualties. The game features a large open world which can be explored either on foot or on horseback. When facing enemies, the player can choose to engage in a direct confrontation using Jin's katana or to use stealth tactics to assassinate opponents. A multiplayer mode titled Ghost of Tsushima: Legends was released in October 2020 and made available separately in September 2021. Sucker Punch began developing the game after the release of Infamous First Light in 2014, as the studio wanted to move on from the Infamous franchise to create a game with a heavy emphasis on melee combat. The studio collaborated with Japan Studio and visited Tsushima Island twice to ensure that the game was as culturally and historically authentic as possible.",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/b/b6/Ghost_of_Tsushima.jpg"
        },
        {
            "game_name": "Fallout: New Vegas",
            "game_id": "18",
            "developer": "Obsidian Entertainment",
            "release_date": "October 19, 2010",
            "game_description": "Fallout: New Vegas is a 2010 action role-playing game that was developed by Obsidian Entertainment and published by Bethesda Softworks. The game, which was released for Microsoft Windows, PlayStation 3, and Xbox 360, is set in the Mojave Desert 204 years after a devastating nuclear war. The player controls a courier who survives an assassination attempt, and becomes embroiled in a conflict between different governing factions that are vying for control of the region. Fallout: New Vegas features a freely explorable open world, and the player can engage in combat with a variety of weapons. The player can also initiate conversations with non-player characters in the form of dialogue trees, and their responses determine their reputation among the different factions. After the release of Fallout 3 in 2008, Bethesda contracted Obsidian to develop a spin-off game in the Fallout series. The developers chose Las Vegas, Nevada, and the surrounding Mojave Desert as the setting because they evoked the 1950s imagery the series was known for, as well as the post-apocalyptic setting of Mad Max. ",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/3/34/Fallout_New_Vegas.jpg"
        },
        {
            "game_name": "Resident Evil 4",
            "game_id": "19",
            "developer": "Capcom",
            "release_date": "January 11, 2005",
            "game_description": "Resident Evil 4 is a 2005 survival horror game developed and published by Capcom for the GameCube. Players control the special agent Leon S. Kennedy on a mission to rescue the US president's daughter, Ashley Graham, who has been kidnapped by a religious cult in rural Spain. Leon fights hordes of enemies infected by a mind-controlling parasite and reunites with the spy Ada Wong. In a departure from the fixed camera angles and slower gameplay of previous Resident Evil games, Resident Evil 4 features a dynamic camera system and action-oriented gameplay. Development on Resident Evil 4 began for the PlayStation 2 in 1999. Four proposed versions were discarded; the first was directed by Hideki Kamiya, but series creator Shinji Mikami felt it was too great a departure from the previous games, so it was spun off as Devil May Cry (2001). Other versions were scrapped until Mikami took directorial duties for what became the final version. The game was announced as part of the Capcom Five, a collaboration between Capcom and Nintendo to create five exclusives for the GameCube.",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/d/d9/Resi4-gc-cover.jpg"
        },
        {
            "game_name": "Halo 4",
            "game_id": "20",
            "developer": "343 Industries",
            "release_date": "November 6, 2012",
            "game_description": "Halo 4 is a 2012 first-person shooter video game developed by 343 Industries and published by Microsoft Studios for the Xbox 360 video game console. Halo 4's story follows a genetically enhanced human supersoldier, Master Chief, and his artificial intelligence construct Cortana, as they encounter unknown threats while exploring an ancient civilization's planet. The player assumes the role of Master Chief who battles against a new faction that splintered off from remnants of the Covenant, a former military alliance of alien races, as well as a new enemy: mechanical warriors of the Forerunner empire known as the Prometheans. The game features a new selection of weapons, enemies, and game modes not present in previous titles of the series. Development of Halo 4 began in 2009 and continued until September 2012. Halo 4 is 343 Industries' first original title within the Halo series—previously, development of the main series was undertaken by Bungie, the creator of the franchise. In the developmental process, 343 Industries decided to explore the Forerunner fiction within the Halo universe, leading the team to design a new setting, enemies, and main antagonist. ",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/9/92/Halo_4_box_artwork.png"
        },
        {
            "game_name": "Final Fantasy VII",
            "game_id": "21",
            "developer": "Square",
            "release_date": "January 31, 1997",
            "game_description": "Final Fantasy VII is a 1997 role-playing video game developed by Square for the PlayStation. The seventh main installment in the Final Fantasy series, it was released in Japan by Square and internationally by Sony Computer Entertainment, becoming the first game in the main series to have a PAL release. The game's story follows Cloud Strife, a mercenary who joins an eco-terrorist organization to stop a world-controlling megacorporation from using the planet's life essence as an energy source. Ensuing events send Cloud and his allies in pursuit of Sephiroth, a superhuman who seeks to wound the planet and harness its healing power in order to be reborn as a god. Throughout their journey, Cloud bonds with his party members, including Aerith Gainsborough, who holds the secret to saving their world. Development began in 1994, originally for the Super Nintendo Entertainment System. After delays and technical difficulties from experimenting with several platforms, most notably the Nintendo 64, Square moved production to the PlayStation, largely due to the advantages of the CD-ROM format. ",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/c/c2/Final_Fantasy_VII_Box_Art.jpg"
        },
        {
            "game_name": "Breath of the Wild",
            "game_id": "22",
            "developer": "Nintendo EPD",
            "release_date": "March 3, 2017",
            "game_description": "he Legend of Zelda: Breath of the Wild is a 2017 action-adventure game developed and published by Nintendo. Set at the end of the Zelda timeline, the player controls an amnesiac Link as he sets out to save Princess Zelda and prevent Calamity Ganon from destroying the world. Players explore the open world of Hyrule while they collect items and complete objectives such as puzzles and side quests. Breath of the Wild's world is unstructured and encourages exploration and experimentation; the story can be completed in a nonlinear fashion. Initially planned as a 2015 Wii U exclusive, Breath of the Wild released on March 3, 2017, for the Wii U and Nintendo Switch; an enhanced edition released on June 5, 2025 for Nintendo Switch 2. Development lasted five years, commencing immediately after the release of The Legend of Zelda: Skyward Sword in 2011. Led by director Hidemaro Fujibayashi and producer Eiji Aonuma, Nintendo sought to rethink Zelda's conventions and introduced elements such as detailed chemistry and physics engines. ",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/c/c6/The_Legend_of_Zelda_Breath_of_the_Wild.jpg"
        },
        {
            "game_name": "Mario Kart 8",
            "game_id": "23",
            "developer": "Nintendo EAD, EPD",
            "release_date": "May 29, 2014",
            "game_description": "Mario Kart 8 is a 2014 kart racing game developed and published by Nintendo for the Wii U. It retains the gameplay of previous Mario Kart games, with players controlling a Mario character in races around tracks. Tracks are themed around locales from the Super Mario series populated with power-ups that help players gain advantages in races. Different difficulties are selectable prior to a race; harder difficulties make gameplay faster. In the new anti-gravity sequences, players drive on walls and ceilings. Mario Kart 8 contains a variety of single-player and local and online multiplayer game modes, including Grand Prix racing and arena-based battle modes. Nintendo revealed Mario Kart 8 in 2013 and released it in May 2014. Both paid and free downloadable content (DLC) was released after its launch, including additional tracks and a new difficulty setting. It was rereleased on the Nintendo Switch in April 2017 as Mario Kart 8 Deluxe, including the DLC, a revamped battle mode and other gameplay alterations. From March 2022 until November 2023, Deluxe received additional DLC: the 'Booster Course Pass', which added 48 circuits and eight characters.",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/b/b5/MarioKart8Boxart.jpg"
        },
        {
            "game_name": "Super Smash Bros. Ultimate",
            "game_id": "24",
            "developer": "Bandai Namco",
            "release_date": "December 7, 2018",
            "game_description": "Super Smash Bros. Ultimate is a 2018 crossover fighting game developed by Bandai Namco Studios and Sora Ltd. and published by Nintendo for the Nintendo Switch. It is the fifth installment in the Super Smash Bros. series, succeeding Super Smash Bros. for Nintendo 3DS and Wii U (2014). The game follows the series' traditional style of gameplay, in which players control one of the various characters and use attacks to weaken their opponents and knock them out of an arena. It features a wide variety of game modes, including a single-player campaign and multiplayer versus modes. Ultimate features 89 playable fighters, including all characters from previous Super Smash Bros. games as well as newcomers. The roster ranges from Nintendo characters to those from third-party franchises. Planning for the game had begun by December 2015, with full development starting after the completion of 3DS/Wii U's downloadable content (DLC). Series creator and director Masahiro Sakurai returned along with Bandai Namco Studios and Sora, the studios that developed 3DS/Wii U, with their return speeding up the preparation process. ",
            "game_cover": "https://upload.wikimedia.org/wikipedia/en/5/50/Super_Smash_Bros._Ultimate.jpg"
        }
    ]
}